# Development Tools Brewfile
# Install with: brew bundle

# Development
brew "git"
brew "git-crypt"
brew "uv"  # Fast Python package manager
brew "stylua"  # Lua formatter
brew "markdownlint-cli"

# Terminal Enhancement
brew "delta"  # Syntax-highlighting pager for git diffs
brew "bat"  # Cat clone with syntax highlighting
brew "moor"  # Modern pager (enhanced less alternative)
brew "riff"  # Enhanced line-level diff highlighting (pairs with moor/delta)

# Language Servers
brew "ansible-language-server"
brew "fish-lsp"
brew "lua-language-server"
brew "marksman"
brew "markdown-oxide"
brew "typos-lsp"
